<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<head><!-- Head START -->
	<title>Nur kostenlose Alternative ?</title><!-- Meta START -->
	<meta http-equiv="expires" content="0"> 
	<meta name="copyright" content="Seminar-CD V3 (c) 2006"> 
	<meta name="author" content="Seminar-CD V3"> 
	<meta name="description" content=""> 
	<meta name="keywords" content=""> 
	<meta name="robots" content="follow"> 
	<meta http-equiv="content-language" content="de"> 
	<meta http-equiv="content-type" content="text/html; charset=utf-8"><!-- Meta END --><!-- Stylesheet Screen START --><style type="text/css" media="screen">
@import url(../style/screen/style.css);
@import url(../style/screen/navigation.css);
</style><!-- Stylesheet Screen END --><!-- Stylesheet Print START --><style type="text/css" media="print">
@import url(../style/print/style.css);
@import url(../style/print/navigation.css);
</style><!-- Stylesheet Print END --><!-- openEngine Comment START --><style type="text/css">
.oe_comment { display:none; }
</style><!-- openEngine Comment END --><!-- RSS Newsfeed START -->
<link rel="alternate" type="application/rss+xml" title="Seminar-CD V3 - RSS 2.0" href="/de/rss.xml"><!-- RSS Newsfeed END --><!-- Head END --></head>
<div>
	<div id="container"><br>
	<div id="container_content"><div id="content">
		<h1>Freie Software - Nur Alternative oder mehr</h1>
	<div id="right"><div class="text">
			
			<p><span style="font-weight: bold;"></span></p>
			<p><span style="font-weight: bold;">Freie Software &#8211; nur kostenlose Alternative oder mehr</span><strong>?</strong></p>
			<p><strong>&#8222;Krieg der Betriebssysteme&#8220; oder Auf dem Weg zu mehr informationstechnischer Selbstbestimmung?</strong></p>
			<p style="margin-bottom: 0cm; text-align: left;">Im Studienseminar Neuss verfolgen wir seit 2003 im Bereich der Schulung an und mit den elektronischen Medien konsequent eine doppelte Strategie. Anwenderschulung allein kann es nicht sein, wenn es um eine medienkritisch orientierte Lehrerausbildung geht. Aus diesem Grund bauen wir die Softwarestruktur in Richtung auf freie Software einschließlich einem freien Betriebssystem um, pflegen aber zweitens auch die Linie, die mit dem Namen Microsoft verkn&uuml;pft ist.</p>
			<p style="margin-bottom: 0cm; text-align: left;">Wir sind der Meinung, dass eine Grundbildung im Bereich der elektronischen Medien (neu sind sie ja nun schon lange nicht mehr!) in der Lehrerausbildung auch eine Reflexion und Bewusstmachung der Problematik um Betriebssysteme und freie Software, um informationstechnische Selbstbestimmung und das Wissen um Alternativen einschließen sollte. Dazu kommt eine Preispolitik des Monopolisten, die es uns geraten erscheinen ließ, rechtzeitig Alternativen aufzubauen.</p>
			<p style="margin-bottom: 0cm; text-align: left;">Der erste Schritt im Umbau ist gemacht. Der Ausbildungsserver arbeitet (&uuml;brigens von Beginn an) unter Linux, ausnahmslos alle Rechner des Rechnerraums k&ouml;nnen inzwischen sowohl Linux (Seminarix, eine Untermenge zur Distribution Debian: N&auml;here Informationen unter www.seminarix.org) als auch Windows starten. &Uuml;berfl&uuml;ssig zu erw&auml;hnen, dass wir f&uuml;r den Aufbau eines funktionst&uuml;chtigen, mit Office-Paket und Netzanbindung versehenen Rechners mit einem freien Betriebsystem rund 40 Minuten, f&uuml;r den Aufbau eines Microsoft-Rechners mit vergleichbaren Funktionalit&auml;ten mindestens 4 Stunden brauchen.</p>
			<p style="margin-bottom: 0cm; text-align: left;">Das Unwissen um freie Software ist europaweit verbreitet. So haben wir z. B. als Seminar in einem Comenius 2.1 Projekt mit gearbeitet, das sich neben anderem auch zur Aufgabe gesetzt hat, Software zur F&uuml;hrung eines digitalen Portfolios (Weitere Informationen auf unserer Internetpr&auml;senz <a href="http://www.studienseminar-neuss.nrw.de/" target="_blank" class="western">www.studienseminar-neuss.nrw.de</a> oder unter <a href="http://www.ediped.com.cy/" target="_blank" class="western">www.ediped.com.cy</a>) zu entwickeln. Auf einem Treffen teilte der Koordinator des Projekts im Januar 2004 mit, er habe beschlossen, dass die Software zum digitalen Portfolio propriet&auml;r sein solle und verkauft werden m&uuml;sse. Nur so konnte er sich vorstellen, dass eine Weiterentwicklung der Software nach der Beendigung der F&ouml;rderung durch Br&uuml;ssel weiter zu finanzieren sei. Ein weit verbreiteter Irrtum.</p>
			<p align="left">Als ausbildende Institution ist es im Sinne der Entwicklung einer medienkritischen Kompetenz nicht n&ouml;tig, eine Entscheidung <span style="font-style: italic;">f&uuml;r</span>oder <span style="font-style: italic;">gegen</span> ein System zu treffen, wichtig ist es, die Alternativen und ihre Leistungsmglichkeiten zu zeigen. Wichtig ist vor allem, ein Bewusstsein der n&auml;chsten Lehrergeneration f&uuml;r die dahinter stehende Thematik anzuregen.&nbsp;</p>
			<p><span style="font-weight: bold;">Wo liegt eigentlich das Problem</span><strong>?</strong></p>
			<p align="left">Alle Bibliotheken, die vor der Aufgabe stehen, ihre Textbest&auml;nde zu digitalisieren, kennen das Problem. In welchem Dateiformat soll das Ergebnis abgespeichert werden? Im Jahr 2006 mussten wir aus irgendwelchen Gr&uuml;nden das Officepaket 2003 (von Microsoft) verwenden, um Datenbankeinbindungen nutzen zu k&ouml;nnen. Nach der Installation des Pakets waren alle unsere Dokumente, die wir mit dem Officepaket 97 (immerhin von der gleichen Firma) hergestellt hatten, nicht mehr lesbar. Sicher, es gibt Zeitschriften, die sich um derlei Probleme gerne und vor allem gewinnbringend k&uuml;mmern. Nicht  umsonst spricht man bei Software dieser Art gerne schon mal von Bananenprodukt. Bananen reifen bekanntlich beim Endverbraucher. Dass Dateien in geschlossenen Formaten vorliegen, ist ja bekannt. Aber dass die Ergebnisse bereits sieben Jahre sp&auml;ter von einem Nachfolgeprodukt aus der gleichen Firma nicht mehr ohne Aufwand gelesen werden k&ouml;nnen, das ist schon heftig. Der Grund liegt darin, dass die Datei in einem Standard geschrieben ist, der geschlossen ist, in einem sogenannten propriet&auml;ren Standard.</p>
			<p align="left">Nun k&ouml;nnte man vermuten, dass Standards in Kommissionen oder Arbeitskreisen verhandelt werden und hernach als Grundlage vereinbart werden. Derlei &Ouml;berlegungen sind dann jedoch hinf&auml;llig, wenn eine Softwareschmiede eine beherrschende Stellung hat und sich sozusagen seine eigenen Standards definieren kann. Je nach Verbreitung kann sich dann ein Standard herausbilden, der nirgendwo kontrolliert werden kann oder gar aus einer &ouml;ffentlichen Debatte hervorgegangen w&auml;re. Ein großer Teil dieses Problems besteht darin, dass es sich hier nicht um freie Software und nicht um wirkliche Standards handelt, deren Strukturen &ouml;ffentlich bekannt w&auml;ren.<br><br><span style="font-weight: bold;">Was ist der Unterschied zwischen einer propriet&auml;ren und einer FreienSoftware</span><strong>?</strong> </p>
			<p align="left">&quot;Jeder Computer verarbeitet seine Daten auf der Basis eines bin&auml;ren Codes. Man kann sagen, dass den bin&auml;ren Code nur eine Maschine lesen kann. Auf der anderen Seite schreiben wir Menschen aber Programme in einer f&uuml;r uns lesbaren Weise, einer Programmiersprache. Um die Anweisungen in eine maschinenlesbaren Sprache zu &uuml;bersetzen bedient man sich eines Compilers. Die Regeln, nach denen &uuml;bersetzt wird, ist von Compiler zu Compiler unterschiedlich. Wichtig ist das Wissen, dass es einen Quellcode und einen Bin&auml;rcode gibt. W&auml;hrend der Bin&auml;rcode nur von einem Computer zu lesen ist, ist der Quellcode auch von Menschen mit entsprechenden Kenntnissen lesbar und ver&auml;nderbar.&quot; (Guido Brombach auf dem Linuxtag 2004 in Paderborn).</p>
			<p align="left">Ein wesentlicher Unterschied zwischen propriet&auml;rer und Freier Software besteht in der Offenlegung des Quellcodes. W&auml;hrend mit dem Windows-System nur der Bin&auml;rcode mitgeliefert wird, ist bei GNU/Linux (damit ist das gesamte Betriebssystem inklusive seiner Quellen gemeint, w&auml;hrend Linux nur der Name f&uuml;r den Kernel ist) auch der Quellcode bekannt und frei verf&uuml;gbar. Erst dadurch, dass z. B. Linus Torvalds den Programmiercode zusammen mit seinem Kernel verschickt hat, und andere Programmierer eingeladen hat, sein Programm zu verbessern, konnte Linux zu dem werden, was es heute ist. Und hierin liegt auch der zweite Unterschied zwischen propriet&auml;rer und Freier Software. Die Freie Software darf ver&auml;ndert und angepasst werden, was unter anderem nat&uuml;rlich nur deshalb funktioniert, weil der Quellcode offen ist. </p>
			<p align="left">Man kann festhalten, dass ein offener Quellcode in der Regel offene Standards zur Folge hat. Sollten z.B. durch einen Versionswechsel der Software Inkompatibilit&auml;ten bez&uuml;glich der Dateiformate entstehen, so lassen sich diese durch den offenen Code beheben. </p> 
			<p align="left">Ist der Code geschlossen, so ist man der Politik der zust&auml;ndigen Firma ausgeliefert und kann nur darauf hoffen, dass entsprechende Kompatibilit&auml;ten in sp&auml;teren Releases wiederhergestellt werden. Die informationelle Selbstbestimmung ist an diesem Punkt aufgehoben, wenn man sich in die Abh&auml;ngigkeit eines Monopolisten begibt, der die Macht hat, entsprechende Standards durchzusetzen.<br><br><span style="font-weight: bold;">Was sind die wesentlichen Merkmale freier Software</span><strong>?</strong></p>
			<p align="left">Freie Software ist eine Frage der Freiheit, nicht des Preises. Frei ist hier im Sinne der &#8222;freien&#8220; Rede, nicht im Sinne von Freibier zu verstehen. Freie Software bedeutet, dass der Nutzer die Freiheit hat, die Software anzuwenden, zu kopieren, zu &auml;ndern und zu &uuml;berpr&uuml;fen. Es gibt sozusagen vier Freiheiten: </p>
		<ul> 
			<li> Die Freiheit, das Programm f&uuml;r jeden denkbaren Zweck laufen zu lassen. </li> 
			<li> Die Freiheit, Kopien an andere zu deren Unterst&uuml;tzung weiter zu geben. </li>
			<li> Die Freiheit, das Programm &#8222;auf Herz und Nieren&#8220; zu pr&uuml;fen und an die eigenen Bed&uuml;rfnisse anzupassen. </li> <li> Die Freiheit, das Programm zu verbessern und die Verbesserungen &ouml;ffentlich zu machen.</li>
		</ul>
			<p align="justify">Die letzten beiden Freiheiten die sich der Nutzer heraus nehmen kann, setzen zwingend voraus, dass der Quellcode zur Verf&uuml;gung steht.</p>
			<p style="margin-left: 0.02cm;" align="left">Kurz, eine Software ist dann &#8222;freie&#8220; Software, wenn der Nutzer die o.a. vier Freiheiten hat. Die Basis dieser vier Freiheiten ist, dass dem Autor seine Software nach wie vor geh&ouml;rt, dass der Autor dem Nutzer aber die Freiheit &uuml;berl&auml;sst, mit ihr zu arbeiten. Man kauft nicht wie bei propriet&auml;rer Software eine Lizenz, das heißt begrenzte Benutzerrechte, sondern man hat eine Software, die der Nutzer nutzen kann und mit der er fast alles machen kann. Die Voraussetzung f&uuml;r diese Freiheiten ist der unbeschr&auml;nkte Zugriff auf den Quelltext. Die Regeln daf&uuml;r stehen in der &#8222;General Public License&#8220;.</p>
			<p align="left">Zum Namen GNU findet sich unter <a href="http://www.wikipedia.org/" class="western">www.wikipedia.org</a> folgender Eintrag:</p>
			<p>Der Name GNU entstand aus der Namensgebung, die am MIT - dem Institut, an dem Stallman zu dieser Zeit arbeitete - verbreitet war. F&uuml;r Programme, die anderen Programmen &auml;hneln, wurden rekursive Akronyme als Namen gew&auml;hlt. Da das neue System auf dem verbreiteten Betriebssystem UNIX aufbauen sollte, suchte Stallman einen solchen Namen und kam dabei auf GNU, was f&uuml;r "GNU is not Unix" steht. Der Name soll, um Verwechslungen zu vermeiden, wie das deutsche 'Gnu' ausgesprochen werden, nicht wie im Englischen (also wie new). Die Entscheidung, GNU Unix-kompatibel zu machen, hatte mehrere Gr&uuml;nde. Zum einen war Stallman sicher, dass die meisten Firmen ein grundlegend neues Betriebssystem ablehnen w&uuml;rden, wenn die Programme, die sie benutzten darauf nicht laufen w&uuml;rden. Andererseits erm&ouml;glichte die Architektur von Unix eine schnelle, einfache und verteilte Entwicklung, da Unix aus vielen kleinen Programmen besteht, die gr&ouml;ßtenteils unabh&auml;ngig von einander entwickelt werden k&ouml;nnen. Auch waren viele Bestandteile eines Unix-Systems frei f&uuml;r jeden erh&auml;ltlich und konnten so direkt in GNU integriert werden, beispielsweise das Textsatzsystem TeX oder das Fenstersystem X Window. Die fehlenden Teile wurden von Grund auf neu geschrieben. Soweit Wikipedia.</p>
			<p>Eine deutsche &Uuml;bersetzung der GNU GPL finden sich hier: <a href="http://www.gnu.de/gpl-ger.html" class="western">http://www.gnu.de/gpl-ger.html</a> Wenn Software unter der GNU GPL verteilt wird, darf der Empf&auml;nger sie benutzen, ver&auml;ndern, weiter verschenken oder auch weiter verkaufen. Er darf aber niemand anderem verbieten, dasselbe zu tun, und wenn er sie weiter gibt, muss er eben den Quelltext dazulegen. Der große Vorteil der GNU GPL ist, dass sie freie Software vor der Umwandlung in nicht-freie Software sch&uuml;tzt. Deshalb gibt sich Microsoft große M&uuml;he, dagegen anzugehen. Andere Lizenzen gefallen Microsoft sehr viel besser. Wenn ein Software-Autor sein Produkt der Allgemeinheit als &#8222;public domain&#8220; schenkt, darf jeder sie nach eigenem Gusto benutzen - auch verkaufen und dem K&auml;ufer verbieten, die Software seinerseits weiter zu verschenken.&nbsp;</p>
			<p><span style="font-weight: bold;">Wird freie Software denn &uuml;berhaupt weiter entwickelt</span><strong>?</strong></p>
			<p>Die Anpassung an eigene Bed&uuml;rfnisse und Weitergabe von Modifikationen f&uuml;hren dazu, dass Ver&auml;nderungs- und Anpassungsw&uuml;nsche entstehen. Diese f&uuml;hren zum Beispiel im Debian-Projekt dazu, dass mehrere Entwickler an demselben Problem bzw. an dessen L&ouml;sung arbeiten. Ist eine gewisse stabile Entwicklungsstufe erreicht, wird das Ergebnis freigegeben. So entsteht in der Dynamik der Kooperation die bestm&ouml;gliche L&ouml;sung des Problems. Raymond nennt es das peer review, frei &uuml;bersetzt die gegenseitige &Uuml;berpr&uuml;fung. Auf diese Art und Weise wurde GNU/Linux programmiert. Nicht umsonst sagt man GNU/Linux eine besondere Stabilit&auml;t und Zuverl&auml;ssigkeit nach. Das peer review beschr&auml;nkt sich im &uuml;brigen nicht nur auf die Entwickler, viele User sind inzwischen ebenfalls aktiv, sie melden Programmfehler den Entwicklern weiter, die daraufhin diese Fehler beheben k&ouml;nnen."&nbsp;</p>
			<p><span style="font-weight: bold;">Ist freie Software grunds&auml;tzlich gratis</span><strong>?</strong></p>
			<p>Meist wird Freie Software mit Gratissoftware gleich gesetzt. Das ist jedoch grundlegend falsch. Freie Software ist nicht naturgem&auml;&szlig; kostenlos zu bekommen, in der Regel versetzt uns Software ohne Support (bestes Beispiel ist Microsoft!) nicht in die Lage, mit einem lauff&auml;higen System auf dem Rechner arbeiten zu k&ouml;nnen. Eric Raymond hat mal gesagt, die Softwareindustrie sei keine Fertigungs- sondern eine Dienstleistungsindustrie. Software alleine sei wertlos.</p>
			<span style="font-weight: bold;">Gibt es einen Programmcode, der g&auml;nzlich frei und jedermann zum &Auml;ndern anheim gestellt wird</span><strong>?</strong>&nbsp;
			<p style="margin-bottom: 0cm; text-align: left;">Dies ist nur bei der sog. "Public-Domain-Software" der Fall. Hier gibt der Autor alle Rechte ab. Allerdings ist das in Deutschland gar nicht m&ouml;glich, da das Urheberrecht ein Pers&ouml;nlichkeitsrecht ist. Man kann es gar nicht abgeben. In den USA ist da machbar.&nbsp;Man kann aber hierzulande ganz analog der Allgemeinheit ein unbeschr&auml;nktes Nutzungsrecht einr&auml;umen. Die "X11 license" und die "revised BSD license" sind nicht ganz so gro&szlig;z&uuml;gig wie public domain, aber auch hier ist eine Umwandlung in nicht-freie Software m&ouml;glich. Informationen zu verschiedenen Lizenzen gibt es hier: </p>
		<ul> 
			<li><a href="http://www.gnu.org/licenses/licenses.html" target="_blank">http://www.gnu.org/licenses/licenses.html</a></li>
			<li><a href="http://www.gnu.org/licenses/license-list.html" target="_blank">http://www.gnu.org/licenses/license-list.html</a></li>
		</ul>
			<p>Viele Museen und andere unter dem Archivierungsdruck stehenden Institutionen setzen aus einem Grund auf Freie Software bzw. offene Standards: Zum einen wissen sie in diesem Fall, welche Daten gespeichert werden und welche nicht. Zum anderen haben sie selbst die Macht &uuml;ber entsprechende Formate.&nbsp;</p>
			<p><span style="font-weight: bold;">Wieso ist eigentlich die Frage nach dem Betriebssystem im Rahmen der Lehrerbildung eine so wichtige</span><strong>?</strong></p>
			An dem &#8222;Krieg der Betriebssysteme&#8220; bricht sich eine schon seid ewigen Zeiten bestehende Auseinandersetzung zwischen der Verwertung und der Geheimhaltung von Wissen auf der einen Seite und der &Ouml;ffnung und Transparenz von Wissen auf der anderen Seite. Diese Auseinandersetzung hat sich nur weiter versch&auml;rft, seitdem der Computer sich zu einer Basistechnik herausgesch&auml;lt hat und damit das Betriebssystem zu einer grundlegenden Voraussetzung der Verf&uuml;gbarmachung dieser Technologie geworden ist. Nie konnte man mit Informationen so viel Geld verdienen wie heute. Wodurch die Begehrlichkeiten und die Vormachtstellung auf dem weltweiten Markt deutlich gewachsen sind. Freie Software entzieht sich dieser Auseinandersetzung und begegnet die Goliaths auf eine ihnen fremde Weise, fern den Regeln der Marktwirtschaft. Das Bestehen von freier Software ist nicht abh&auml;ngig von einem guten Aktienkurs, sondern von dem Engagement der Entwickler.<br>Dazu kommt ein Weiteres: Hinter der Auseinandersetzung um Betriebssysteme ist auch eine Auseinandersetzung zwischen zwei Geisteshaltungen erkennbar. Die eine Seite setzt auf das technisch Machbare und gibt sich mit der technisch optimalen (bezahlbaren?) L&ouml;sung zufrieden. Mit der L&ouml;sung ist sozusagen der Job getan. <br>Auf der anderen Seite stehen Menschen, die die Implikationen technisch m&ouml;glicher Entscheidungen mit reflektiert haben wollen, die&nbsp;eine Folgenabsch&auml;tzung f&uuml;r zwingend halten, *bevor* technische L&ouml;sungen entschieden werden. Man erinnere sich an die Diskussion um die Atomtechnik, auch der Widerstand um die Volksz&auml;hlung schlo&szlig; solche Elemente ein.<br><br>
            In die Lehrerausbildung geh&ouml;rt diese Diskussion &nbsp;und zwar unabh&auml;ngig von der Entscheidung f&uuml;r die Seite &quot;Technik&quot; versus &quot;Folgeneinsch&auml;tzung&quot;. Es ist das &nbsp;Problem selbst, das in das Buwusstsein der k&uuml;nftigen Lehrerinnen und Lehrer geh&ouml;rt.
            <br>
			<p><span style="font-weight: bold;">Wo finde ich weitere Informationen &uuml;ber dieses Thema</span><strong>?</strong></p>
			<p style="margin-bottom: 0cm; text-align: left;">Das Internet ist inzwischen bereit, auf alle der oben aufgef&uuml;hrten Stichworte Antworten zu liefern. Es gibt eine Reihe von Dokumentationen, die zu diesem Thema aussagen. Aus Gr&uuml;nden, dass die erste Version von Seminarix von der Firma G-N-U entwickelt wurde, sei auf deren Dokumentation verwiesen. Sie finden sie unter&nbsp; <a href="http://www.gnu.de/" target="_blank" class="western">http://www.gnu.de</a></p>
			<p style="margin-bottom: 0cm; text-align: left;">Weitere Literatur:</p>
		<ul> 
			<li>OpenSource-Jahrbuch 2008 </li> 
			<li>Volker Grassmuck: Freie Software (Bundeszentrale f&uuml;r Politische Bildung) Bonn 2002&nbsp; </li>
		</ul>
			<p><strong>Ausblick</strong></p><strong></strong>
			<p style="margin-bottom: 0cm; text-align: left;">Die Arbeit der n&auml;chsten Zeit wird im Seminar Neuss in mehrere Richtungen gehen m&uuml;ssen. Zum einen sind die s&auml;chlichen Voraussetzungen daf&uuml;r zu schaffen, dass alle Rechner nicht nur Windows bedienen, sondern als Dual-Boot-Maschinen ausger&uuml;stet werden. Diese Arbeit ist inzwischen erledigt.&nbsp;</p>
			<p style="margin-bottom: 0cm; text-align: left;">Der zweite Schritt wird in einer Schulung aller Ausbilderinnen und Ausbilder sowie der Referendarinnen und Referendare, der Lehramtsanw&auml;rterinnen und Lehramtsanw&auml;rter bestehen m&uuml;ssen. Dieser Aufgabe soll neben anderem auch Seminarix (Sidux)wie auch diese Dokumentation stattgefundener und erprobter Projektmaterialien dienen. Sie sollen anregen, eigene Ideen auszuprobieren, sie sollen Nachdenken &uuml;ber Software und Betriebssysteme unterst&uuml;tzen und sie sollen das Bewusstsein daf&uuml;r sch&auml;rfen, dass die User zunehmend ProdUser werden. </p>
			<p>Weitere Informationen und Bezugsquellen finden Sie unter <a href="http://www.seminarix.org/" target="_blank">http://www.seminarix.org</a></p></div></div>
			<div class="cleardiv"></div></div></div>
	<div id="container_bottom"></div>
	<table style="page-break-before: always;" border="1" cellpadding="2" cellspacing="2"> <tbody>
		<tr>
		<td style="vertical-align: top;">Copyright:</td>
		<td style="vertical-align: top;">Copyright © 2008-2009, Wolf-Dieter Zimmermann,<br>License: CC-by-SA 3.0</td></tr>
</tbody></table>
</div>
</div>
<p>
    <a href="http://validator.w3.org/check?uri=referer"><img
        src="http://www.w3.org/Icons/valid-html40-blue"
        alt="Valid HTML 4.0 Transitional" height="31" width="88"></a>
</p>
</body>
</html>
