<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">
  <title>Website (Fortgeschrittene)</title></head>
<body>
<table style="text-align: left; width: 100%;" border="1" cellpadding="2" cellspacing="2">
  <tbody>
    <tr>
      <td style="vertical-align: top; text-align: left; width: 20%; font-weight: bold;">Projekt
      </td>
      <td style="vertical-align: top; width: 80%; font-weight: bold; text-align: center;">Web, Website (Fortgeschrittene)</td>
    </tr>
    <tr>
      <td align="left" valign="top">Problem/Frage</td>
      <td align="left" valign="top">
            Wie k&ouml;nnen auch gr&ouml;&szlig;ere Websiten f&uuml;r schulische Zwecke erstellt werden? Was ist dabei zu beachten? Welche M&ouml;glichkeiten gibt es hinsichtlich Umsetzung und sp&auml;ter, um den Wartungsaufwand zu minimieren? Welche "fertigen" Angebote k&ouml;nnen sinnvoll genutzt bzw. angepasst werden? Was bringt CSS?
            <br>
      </td>
    </tr>
    <tr>
      <td align="left" valign="top">Ziele <br>
(Schwierigkeitsstufen)</td>
      <td align="left" valign="top">
            Konzeption, Planung und Entwicklung einer gr&ouml;&szlig;eren Website zur Pr&auml;sentation schulischer Inhalte (z. B. Schulwebsite, Projekt-Website o. &auml;.).
            <br>
            Die Schwierigkeitsstufe ist abh&auml;ngig von der verwendeten Softwarel&ouml;sung variabel.
            <br>
      </td>
    </tr>
    <tr>
      <td align="left" valign="top">
            Durchf&uuml;hrung
            <br>
             (einschlie&szlig;lich verwendeter Materialien / Software / Hardware)
          </td>
      <td align="left" valign="top">
            Das Projekt "Website f&uuml;r Fortgeschrittene" setzt Kenntnisse aus dem Projekt "Web" voraus. Im Rahmen des Projekts werden die M&ouml;glichkeiten zur Gestaltung gr&ouml;&szlig;erer Websites vorgestellt und die dabei auftretendenden spezifischen Probleme angesprochen. Die erworbenen Kenntnisse und F&auml;higkeiten sollen bei Konzeption und Gestaltung eines Website-Projekts praktisch angewandt werden.
            <br>
            In einem ersten Schritt erfolgt eine kurze Einf&uuml;hrung in CSS (Stichwort "Trennung von Format und Inhalt"), anschlie&szlig;end werden unterschiedliche Software-L&ouml;sungen sowie Online-Quellen (opendesigns.org, oswd.org) f&uuml;r die Umsetzung eines Website-Projekts vorgestellt.
            <br>
            In einem zweiten Schritt werden Themen angesprochen, die bei der Gestaltung und Ver&ouml;ffentlichung einer Website zu ber&uuml;cksichtigen sind (u. a. Urheberrecht, Pers&ouml;nlichkeitsrechte, Bildrechte, Lizenzen usw.). Quellen freie Inhalte (Bilder, Videos, Audiodateien) werden ebenso wie die verschiedenen freien Lizenzmodelle (CC-Lizenzen, GNU FDL usw.) vorgestellt. Es wird er&auml;utert, was getan werden muss, um freie Inhalte lizenzkonform zu nutzen. 
            <br>Abschlie&szlig;end wird erl&auml;utert, wie Inhalte im Netz ver&ouml;ffentlicht (u. a. FileZilla) und anschlie&szlig;end gepflegt werden k&ouml;nnen.<br><br>Software
u. a.: KompoZer, FileZilla; webbasierte Dienste, Blogs, Wikis;
spezielle L&ouml;sungen (Webalben f&uuml;r Fotos) - es sollen jeweils Vor- und
Nachteile angesprochen werden.<br>
      </td>
    </tr>
    <tr>
      <td align="left" valign="top">Alternativen</td>
      <td align="left" valign="top">
            Besprechung konkreter Probleme bei 'echten' Websites; Schwerpunktsetzung je nach den Bed&uuml;rfnissen und W&uuml;nschen der Teilnehmerinnen und Teilnehmer.
            <br>
      </td>
    </tr>
    <tr>
      <td align="left" valign="top">Hinweise</td>
      <td style="vertical-align: top; text-align: left;">
            Die zentralen Inhalte des Projekts sollten in kurzer Zeit vorgestellt werden k&ouml;nnen. &Uuml;ber eine Schwerpunktssetzung kann das Projekt an einen konkret vorgegebenen Zeitrahmen angepasst werden. Das Projekt vermittelt grundlegende Medienkompetenzen sowie basale Kenntnisse f&uuml;r den Einsatz und die Erstellung von Webinhalten im Schulalltag.
            <br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">Didaktischer Mehrwert</td>
      <td style="vertical-align: top;">
            Immer mehr findet auch im schulischen Bereich online statt. &Uuml;ber das Projekt lassen sich grundlegende Kenntnisse im Bereich Bild- und Pers&ouml;nlichkeitsrechte praxisnah vermitteln. Im Unterricht k&ouml;nnen die Inhalte des Projekts an Sch&uuml;lerinnen und Sch&uuml;ler zum Zwecke der Medienkompetenz-Schulung weitergeben werden (u. a. Medienkunde, Mediennutzung, Mediengestaltung, ...). 
            <br>
      </td>
    </tr>
   <tr>
      <td style="vertical-align: top;">Evaluation</td>
      <td style="vertical-align: top;">
            Wer hat organisiert / durchgef&uuml;hrt / moderiert / geleitet?
            <br>
             Wie selbstst&auml;ndig konnten / mussten / durften die Teilnehmer sein?
            <br>
             Welche Unterst&uuml;tzung haben die Teilnehmer durch andere / durch die Organisation / die Leitung erfahren? War das zu viel / zu wenig / genau richtig?
            <br>
             Sind Ergebnisse / Prozesse auf andere F&auml;cher / Fachbereiche im Seminar / zwischen den Seminaren &uuml;bertragbar?
            <br>
             Wo k&ouml;nnten Ergebnisse als Prozess / als Ergebnis / als Anregung im Schulalltag auftauchen?
          </td>
    </tr>
    <tr>
      <td style="vertical-align: top; text-align: left;">Weitere Links /Arbeitsanregungen</td>
      <td align="left" valign="top">u. a. http://de.selfhtml.org,&nbsp;http://www.oswd.org,&nbsp;http://www.opendesigns.org </td>
    </tr>
  <tr><td style="vertical-align: top;">Copyright:</td><td style="vertical-align: top;">Copyright &copy; 2008-2009, Wolf-Dieter Zimmermann<br>
Copyright &copy; 2008-2009, Michael Reschke<br>License: CC-by-SA 3.0</td></tr></tbody>
</table>
<br>
<p>
	<a href="http://validator.w3.org/check?uri=referer"><img
        src="http://www.w3.org/Icons/valid-html40-blue"
        alt="Valid HTML 4.0 Transitional" height="31" width="88"></a>
  </p>
</body></html>
